In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from numpy import mean
from numpy import std

In [2]:
df = pd.read_csv('data/names/yob1880.txt', sep=",", header=None, names=["name", "gender", "frequency"])
df=df.sort_values(by=['frequency'])
print(len(df['name'].unique()))
print(df)

1889
           name gender  frequency
1999  Zachariah      M          5
900     Manuela      F          5
899    Manervia      F          5
898     Mahalia      F          5
897      Madora      F          5
...         ...    ...        ...
945     Charles      M       5348
944       James      M       5927
0          Mary      F       7065
943     William      M       9532
942        John      M       9655

[2000 rows x 3 columns]

In [3]:

df2 = pd.read_csv('data/names/yob1881.txt', sep=",", header=None, names=["name", "gender", "frequency"])
df2=df2.sort_values(by=['frequency'])

In [4]:
print(len(df2['name'].unique()))
print(df2)

1830
         name gender  frequency
1934   Wright      M          5
896    Lissie      F          5
895     Lilie      F          5
894     Libby      F          5
893    Levina      F          5
...       ...    ...        ...
941    George      M       4664
940     James      M       5441
0        Mary      F       6919
939   William      M       8524
938      John      M       8769

[1935 rows x 3 columns]

In [5]:
df3=pd.concat([df, df2]).groupby(['name', 'gender']).sum().reset_index()

In [6]:
df3.sort_values(by=['frequency'])

          name gender  frequency
883    Gardner      M          5
481   Cordella      F          5
2171    Vaughn      M          5
475     Conway      M          5
1931     Robin      M          5
...        ...    ...        ...
392    Charles      M       9984
1129     James      M      11368
1553      Mary      F      13984
2255   William      M      18056
1186      John      M      18424

[2310 rows x 3 columns]

In [10]:
for i in range(2009, 2018):
    year = i
    next_year = i + 1
    if year == 2009:
        df = pd.read_csv('data/names/yob%s.txt' % year, sep=",", header=None, names=["name", "gender", "frequency"])
        df2 = pd.read_csv('data/names/yob%s.txt' % next_year, sep=",", header=None, names=["name", "gender", "frequency"])
        df=pd.concat([df, df2]).groupby(['name', 'gender']).sum().reset_index()
    else:
        df2 = pd.read_csv('data/names/yob%s.txt' % next_year, sep=",", header=None, names=["name", "gender", "frequency"])
        df=pd.concat([df, df2]).groupby(['name', 'gender']).sum().reset_index()

In [12]:
df= df.sort_values(by=['frequency'])

In [13]:
df

            name gender  frequency
12015  Chikamara      F          5
42343     Nahjai      F          5
12138  Chrissean      M          5
12145     Christ      F          5
42334      Nahil      M          5
...          ...    ...        ...
23190   Isabella      F     179015
43987       Noah      M     180904
44660     Olivia      F     183016
52431     Sophia      F     183930
18071       Emma      F     195305

[60571 rows x 3 columns]